load-tests/jmeter/gui-500rpm.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Solventa - 500 RPM for 10 minutes (GUI)" enabled="true">
      <stringProp name="TestPlan.comments">Visual 500-RPM run for 10 minutes. Global Play refreshes AWS SigV4 credentials at test start and redacts them before listeners. Do not use Start Selected.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="AUTO - refresh AWS credentials when global Play is pressed">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Refresh and validate solventa-lab credentials in memory" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="filename">${__P(credential_refresh_script_path,refresh-aws-credentials.groovy)}</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="measured - GUI 500 aggregate RPM for 10 minutes" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(gui_threads,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(gui_ramp_seconds,5)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(gui_duration_seconds,600)}</stringProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Create visible synthetic request body" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">vars.put(&apos;partner_ref&apos;, &apos;partner-01&apos;)
vars.put(&apos;profile_ref&apos;, &apos;profile-00000000-0000-4000-8000-000000000101&apos;)
vars.put(&apos;request_body&apos;, &apos;{&quot;partner_ref&quot;:&quot;partner-01&quot;,&quot;profile_ref&quot;:&quot;profile-00000000-0000-4000-8000-000000000101&quot;,&quot;requested_amount&quot;:10000000,&quot;term_months&quot;:12}&apos;)</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Sign exact request with temporary AWS SigV4 credentials" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="filename">${__P(sigv4_script_path,sigv4.groovy)}</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP headers - generated at runtime" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${sigv4_authorization}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Amz-Date</stringProp>
              <stringProp name="Header.value">${sigv4_amz_date}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">X-Amz-Security-Token</stringProp>
              <stringProp name="Header.value">${sigv4_session_token}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="500 aggregate RPM limiter" enabled="true">
          <stringProp name="throughput">${__P(target_rpm,500)}</stringProp>
          <intProp name="calcMode">4</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/cotizaciones" enabled="true">
          <stringProp name="HTTPSampler.connect_timeout">${__P(connect_timeout_ms,2000)}</stringProp>
          <stringProp name="HTTPSampler.response_timeout">${__P(response_timeout_ms,5000)}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${__P(target_url)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${request_body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Require HTTP 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Quotation must return HTTP 2xx</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Validate quotation response fields" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">try {
    def payload = new groovy.json.JsonSlurper().parseText(prev.getResponseDataAsString())
    def requiredKeys = [&apos;quotation_id&apos;, &apos;request_id&apos;, &apos;partner_ref&apos;, &apos;profile_ref&apos;, &apos;currency&apos;, &apos;monthly_premium&apos;, &apos;risk_score&apos;, &apos;tariff_version&apos;, &apos;calculation_checksum&apos;] as Set
    if (!(payload instanceof Map) || payload.keySet() != requiredKeys || payload.partner_ref != vars.get(&apos;partner_ref&apos;) || payload.profile_ref != vars.get(&apos;profile_ref&apos;)) {
        AssertionResult.setFailure(true)
        AssertionResult.setFailureMessage(&apos;Quotation response does not match the expected synthetic contract&apos;)
    }
} catch (Exception ignored) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&apos;Quotation response is not valid JSON&apos;)
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Redact temporary AWS headers before listeners" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setRequestHeaders(&apos;[redacted temporary AWS SigV4 headers]&apos;)
vars.put(&apos;sigv4_authorization&apos;, &apos;[redacted]&apos;)
vars.put(&apos;sigv4_amz_date&apos;, &apos;[redacted]&apos;)
vars.put(&apos;sigv4_session_token&apos;, &apos;[redacted]&apos;)</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="AUTO - clear AWS credentials after the test" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Remove temporary AWS credentials from memory" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def runtimeCredentials = props.remove(&apos;solventa.runtime.aws.credentials&apos;)
if (runtimeCredentials != null) {
    try {
        runtimeCredentials.clear()
    } catch (Exception ignored) {
        // Removing the property is the required cleanup boundary.
    }
}
SampleResult.setSuccessful(true)
SampleResult.setResponseCode(&apos;200&apos;)
SampleResult.setResponseMessage(&apos;Temporary AWS credentials cleared from memory&apos;)
SampleResult.setResponseData(&apos;Temporary AWS credentials cleared; values were never persisted.&apos;, &apos;UTF-8&apos;)
SampleResult.setIgnore()</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree - response body" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table - sample time and latency" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report - response time percentiles" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>